In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('data/gapminder-unclean.csv')
df

          country continent  year  lifeExp       pop   gdpPercap iso_alpha
0     Afghanistan      Asia  1952   28.801   8425333  779.445314       AFG
1     Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2     Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
3     Afghanistan      Asia  1967   34.020  11537966  836.197138       AFG
4     Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG
...           ...       ...   ...      ...       ...         ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306       ZWE
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786       ZWE
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960       ZWE
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623       ZWE
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298       ZWE

[1704 rows x 7 columns]

In [4]:
df.head(5)

       country continent  year  lifeExp       pop   gdpPercap iso_alpha
0  Afghanistan      Asia  1952   28.801   8425333  779.445314       AFG
1  Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2  Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
3  Afghanistan      Asia  1967   34.020  11537966  836.197138       AFG
4  Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG

In [5]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap iso_alpha
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306       ZWE
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786       ZWE
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960       ZWE
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623       ZWE
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298       ZWE

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.shape

(1704, 7)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1692 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1703 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1703 non-null   float64
 6   iso_alpha  1704 non-null   object
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [9]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1703.000000  1.704000e+03    1703.000000
mean   1979.50000    59.476932  2.960121e+07    7211.034188
std      17.26533    12.920492  1.061579e+08    9858.756515
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.185000  2.793664e+06    1201.919257
50%    1979.50000    60.765000  7.023596e+06    3530.690067
75%    1993.25000    70.846000  1.958522e+07    9319.503534
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [10]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap',
       'iso_alpha'],
      dtype='object')

In [11]:
df.keys()

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap',
       'iso_alpha'],
      dtype='object')

In [12]:
df['country'].head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [13]:
df[['country','lifeExp']].head()

       country  lifeExp
0  Afghanistan   28.801
1  Afghanistan   30.332
2  Afghanistan   31.997
3  Afghanistan   34.020
4  Afghanistan   36.088

In [14]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap iso_alpha
0  Afghanistan      Asia  1952   28.801   8425333  779.445314       AFG
1  Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2  Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
3  Afghanistan      Asia  1967   34.020  11537966  836.197138       AFG
4  Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG

In [15]:
df.drop('continent',axis=1,inplace=True)

In [16]:
df.head()

       country  year  lifeExp       pop   gdpPercap iso_alpha
0  Afghanistan  1952   28.801   8425333  779.445314       AFG
1  Afghanistan  1957   30.332   9240934  820.853030       AFG
2  Afghanistan  1962   31.997  10267083  853.100710       AFG
3  Afghanistan  1967   34.020  11537966  836.197138       AFG
4  Afghanistan  1972   36.088  13079460  739.981106       AFG

In [17]:
df = pd.read_csv('data/gapminder-unclean.csv')
df

          country continent  year  lifeExp       pop   gdpPercap iso_alpha
0     Afghanistan      Asia  1952   28.801   8425333  779.445314       AFG
1     Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2     Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
3     Afghanistan      Asia  1967   34.020  11537966  836.197138       AFG
4     Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG
...           ...       ...   ...      ...       ...         ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306       ZWE
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786       ZWE
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960       ZWE
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623       ZWE
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298       ZWE

[1704 rows x 7 columns]

In [18]:
df.loc[3]

country      Afghanistan
continent           Asia
year                1967
lifeExp            34.02
pop             11537966
gdpPercap     836.197138
iso_alpha            AFG
Name: 3, dtype: object

In [19]:
df.iloc[3]

country      Afghanistan
continent           Asia
year                1967
lifeExp            34.02
pop             11537966
gdpPercap     836.197138
iso_alpha            AFG
Name: 3, dtype: object

In [20]:
df.iloc[[1,10]]

        country continent  year  lifeExp       pop   gdpPercap iso_alpha
1   Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
10  Afghanistan      Asia  2002   42.129  25268405  726.734055       AFG

In [21]:
df.iloc[-1]

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
iso_alpha           ZWE
Name: 1703, dtype: object

In [22]:
df.loc[1703]

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
iso_alpha           ZWE
Name: 1703, dtype: object

In [23]:
df.loc[1:10]

        country continent  year  lifeExp       pop   gdpPercap iso_alpha
1   Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2   Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
3   Afghanistan      Asia  1967   34.020  11537966  836.197138       AFG
4   Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG
5   Afghanistan      Asia  1977   38.438  14880372  786.113360       AFG
6   Afghanistan      Asia  1982   39.854  12881816  978.011439       AFG
7   Afghanistan      Asia  1987   40.822  13867957  852.395945       AFG
8   Afghanistan      Asia  1992   41.674  16317921  649.341395       AFG
9   Afghanistan      Asia  1997   41.763  22227415  635.341351       AFG
10  Afghanistan      Asia  2002   42.129  25268405  726.734055       AFG

In [24]:
df.iloc[3:5]

       country continent  year  lifeExp       pop   gdpPercap iso_alpha
3  Afghanistan      Asia  1967   34.020  11537966  836.197138       AFG
4  Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG

In [25]:
df.iloc[1:5,1:4]

  continent  year  lifeExp
1      Asia  1957   30.332
2      Asia  1962   31.997
3      Asia  1967   34.020
4      Asia  1972   36.088

In [26]:
df.loc[1:5, ['continent','country','lifeExp']]

  continent      country  lifeExp
1      Asia  Afghanistan   30.332
2      Asia  Afghanistan   31.997
3      Asia  Afghanistan   34.020
4      Asia  Afghanistan   36.088
5      Asia  Afghanistan   38.438

In [27]:
df.iloc[[1,19,22],[0,2,4]]

        country  year      pop
1   Afghanistan  1957  9240934
19      Albania  1987  3075321
22      Albania  2002  3508512

In [28]:
df.iloc[1:10:2]

       country continent  year  lifeExp       pop   gdpPercap iso_alpha
1  Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
3  Afghanistan      Asia  1967   34.020  11537966  836.197138       AFG
5  Afghanistan      Asia  1977   38.438  14880372  786.113360       AFG
7  Afghanistan      Asia  1987   40.822  13867957  852.395945       AFG
9  Afghanistan      Asia  1997   41.763  22227415  635.341351       AFG

In [29]:
df.loc[1:5,'continent':'lifeExp']

  continent  year  lifeExp
1      Asia  1957   30.332
2      Asia  1962   31.997
3      Asia  1967   34.020
4      Asia  1972   36.088
5      Asia  1977   38.438

In [30]:
df.drop(3, axis=0,inplace = True)

In [31]:
df

          country continent  year  lifeExp       pop   gdpPercap iso_alpha
0     Afghanistan      Asia  1952   28.801   8425333  779.445314       AFG
1     Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2     Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
4     Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG
5     Afghanistan      Asia  1977   38.438  14880372  786.113360       AFG
...           ...       ...   ...      ...       ...         ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306       ZWE
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786       ZWE
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960       ZWE
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623       ZWE
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298       ZWE

[1703 rows x 7 columns]

In [32]:
df.loc[4]

country      Afghanistan
continent           Asia
year                1972
lifeExp           36.088
pop             13079460
gdpPercap     739.981106
iso_alpha            AFG
Name: 4, dtype: object

In [33]:
df.iloc[4]

country      Afghanistan
continent           Asia
year                1977
lifeExp           38.438
pop             14880372
gdpPercap      786.11336
iso_alpha            AFG
Name: 5, dtype: object

In [34]:
 df.index[4]

np.int64(5)

In [35]:
df.head(5)

       country continent  year  lifeExp       pop   gdpPercap iso_alpha
0  Afghanistan      Asia  1952   28.801   8425333  779.445314       AFG
1  Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2  Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
4  Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG
5  Afghanistan      Asia  1977   38.438  14880372  786.113360       AFG

In [36]:
r = df.loc[0]
type(r)

pandas.core.series.Series

In [37]:
c = df['country']
type(c)

pandas.core.series.Series

In [38]:
le = df['lifeExp']
le.mean()

np.float64(59.49188876615746)

In [39]:
le.sum()

np.float64(101255.19468)

In [40]:
le.count()

np.int64(1702)

In [41]:
le.sum()/le.count()

np.float64(59.49188876615746)

In [42]:
df.loc[df.lifeExp> 40].head()

        country continent  year  lifeExp       pop   gdpPercap iso_alpha
7   Afghanistan      Asia  1987   40.822  13867957  852.395945       AFG
8   Afghanistan      Asia  1992   41.674  16317921  649.341395       AFG
9   Afghanistan      Asia  1997   41.763  22227415  635.341351       AFG
10  Afghanistan      Asia  2002   42.129  25268405  726.734055       AFG
11  Afghanistan      Asia  2007   43.828  31889923  974.580338       AFG

In [43]:
df.loc[df.lifeExp>60, ['country','lifeExp']].head()

    country  lifeExp
14  Albania    64.82
15  Albania    66.22
16  Albania    67.69
17  Albania    68.93
18  Albania    70.42

In [44]:
df.loc[(df.lifeExp>=30) & (df.lifeExp<=40)].head()

       country continent  year  lifeExp       pop   gdpPercap iso_alpha
1  Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2  Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
4  Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG
5  Afghanistan      Asia  1977   38.438  14880372  786.113360       AFG
6  Afghanistan      Asia  1982   39.854  12881816  978.011439       AFG

In [45]:
df.country.unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [46]:
df.loc[(df.country=='Kenya') | (df.country=='Egypt')].head()

    country continent  year  lifeExp       pop    gdpPercap iso_alpha
456   Egypt    Africa  1952   41.893  22223309  1418.822445       EGY
457   Egypt    Africa  1957   44.444  25009741  1458.915272       EGY
458   Egypt    Africa  1962   46.992  28173309  1693.335853       EGY
459   Egypt    Africa  1967   49.293  31681188  1814.880728       EGY
460   Egypt    Africa  1972   51.137  34807417  2024.008147       EGY

In [47]:
df.loc[df.country < 'Nigeria']

          country continent  year  lifeExp       pop   gdpPercap iso_alpha
0     Afghanistan      Asia  1952   28.801   8425333  779.445314       AFG
1     Afghanistan      Asia  1957   30.332   9240934  820.853030       AFG
2     Afghanistan      Asia  1962   31.997  10267083  853.100710       AFG
4     Afghanistan      Asia  1972   36.088  13079460  739.981106       AFG
5     Afghanistan      Asia  1977   38.438  14880372  786.113360       AFG
...           ...       ...   ...      ...       ...         ...       ...
1123        Niger    Africa  1987   44.555   7332638  668.300023       NER
1124        Niger    Africa  1992   47.391   8392818  581.182725       NER
1125        Niger    Africa  1997   51.313   9666252  580.305209       NER
1126        Niger    Africa  2002   54.496  11140655  601.074501       NER
1127        Niger    Africa  2007   56.867  12894865  619.676892       NER

[1127 rows x 7 columns]

In [48]:
df.groupby('year')[['lifeExp','gdpPercap']].mean()

        lifeExp     gdpPercap
year
1952  49.013844   3725.276046
1957  51.507401   4299.408345
1962  53.609249   4725.812342
1967  55.831894   5452.260078
1972  57.647386   6770.082815
1977  59.570157   7313.166421
1982  61.533197   7518.901673
1987  63.212613   7900.920218
1992  64.160338   8158.608521
1997  65.014676   9090.175363
2002  65.694923   9917.848365
2007  67.007423  11680.071820

In [49]:
df.groupby(['continent','year'])[['lifeExp','gdpPercap']].mean()

                  lifeExp     gdpPercap
continent year
Africa    1952  39.135500   1252.572466
          1957  41.266346   1385.236062
          1962  43.319442   1598.078825
          1967  45.334538   2050.363801
          1972  47.450942   2339.615674
          1977  49.580423   2585.938508
          1982  51.592865   2481.592960
          1987  53.344788   2282.668991
          1992  53.629577   2281.810333
          1997  53.598269   2378.759555
          2002  53.325231   2599.385159
          2007  54.806038   3089.032605
Americas  1952  53.378292   4161.150810
          1957  55.960280   4616.043733
          1962  58.398760   4901.541870
          1967  60.410920   5668.253496
          1972  62.394920   6491.334139
          1977  64.391560   7352.007126
          1982  66.228840   7506.737088
          1987  68.090720   7793.400261
          1992  69.568360   8044.934406
          1997  71.150480   8889.300863
          2002  72.422040   9287.677107
          2007  73.608120  11003.031625
Asia      1952  46.314394   5195.484004
          1957  49.318544   5787.732940
          1962  51.563223   5729.369625
          1967  55.308754   6131.641381
          1972  57.319269   8187.468699
          1977  59.610556   7791.314020
          1982  62.617939   7434.135157
          1987  64.851182   7608.226508
          1992  66.537212   8639.690248
          1997  68.020515   9834.093295
          2002  69.233879  10174.090397
          2007  70.728485  12473.026870
Europe    1952  64.725000   5661.057435
          1957  66.615586   6868.118064
          1962  68.480241   8274.944747
          1967  69.696138  10040.195569
          1972  70.752103  12335.003925
          1977  71.908034  14117.289614
          1982  72.767655  15433.001746
          1987  73.583276  17031.164094
          1992  74.370448  16767.981787
          1997  75.435345  18784.215773
          2002  76.644759  21409.175480
          2007  77.586793  24756.615310
Oceania   1952  69.255000  10298.085650
          1957  70.295000  11598.522455
          1962  71.085000  12696.452430
          1967  71.310000  14463.918930
          1972  71.910000  16417.333380
          1977  72.855000  17283.957605
          1982  74.290000  18554.709840
          1987  75.320000  20448.040160
          1992  76.945000  20894.045885
          1997  78.190000  24024.175170
          2002  79.740000  26938.778040
          2007  80.719500  29810.188275

In [50]:
df.groupby(['year','continent'])[['lifeExp','gdpPercap']].mean()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.378292   4161.150810
     Asia       46.314394   5195.484004
     Europe     64.725000   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.615586   6868.118064
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.480241   8274.944747
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       55.308754   6131.641381
     Europe     69.696138  10040.195569
     Oceania    71.310000  14463.918930
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.752103  12335.003925
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.908034  14117.289614
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.767655  15433.001746
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.583276  17031.164094
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.370448  16767.981787
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.435345  18784.215773
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.644759  21409.175480
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.586793  24756.615310
     Oceania    80.719500  29810.188275

In [51]:
dfgb = df.groupby(['continent','year'])[['lifeExp','gdpPercap']].mean()
dfgb.reset_index()

   continent  year    lifeExp     gdpPercap
0     Africa  1952  39.135500   1252.572466
1     Africa  1957  41.266346   1385.236062
2     Africa  1962  43.319442   1598.078825
3     Africa  1967  45.334538   2050.363801
4     Africa  1972  47.450942   2339.615674
5     Africa  1977  49.580423   2585.938508
6     Africa  1982  51.592865   2481.592960
7     Africa  1987  53.344788   2282.668991
8     Africa  1992  53.629577   2281.810333
9     Africa  1997  53.598269   2378.759555
10    Africa  2002  53.325231   2599.385159
11    Africa  2007  54.806038   3089.032605
12  Americas  1952  53.378292   4161.150810
13  Americas  1957  55.960280   4616.043733
14  Americas  1962  58.398760   4901.541870
15  Americas  1967  60.410920   5668.253496
16  Americas  1972  62.394920   6491.334139
17  Americas  1977  64.391560   7352.007126
18  Americas  1982  66.228840   7506.737088
19  Americas  1987  68.090720   7793.400261
20  Americas  1992  69.568360   8044.934406
21  Americas  1997  71.150480   8889.300863
22  Americas  2002  72.422040   9287.677107
23  Americas  2007  73.608120  11003.031625
24      Asia  1952  46.314394   5195.484004
25      Asia  1957  49.318544   5787.732940
26      Asia  1962  51.563223   5729.369625
27      Asia  1967  55.308754   6131.641381
28      Asia  1972  57.319269   8187.468699
29      Asia  1977  59.610556   7791.314020
30      Asia  1982  62.617939   7434.135157
31      Asia  1987  64.851182   7608.226508
32      Asia  1992  66.537212   8639.690248
33      Asia  1997  68.020515   9834.093295
34      Asia  2002  69.233879  10174.090397
35      Asia  2007  70.728485  12473.026870
36    Europe  1952  64.725000   5661.057435
37    Europe  1957  66.615586   6868.118064
38    Europe  1962  68.480241   8274.944747
39    Europe  1967  69.696138  10040.195569
40    Europe  1972  70.752103  12335.003925
41    Europe  1977  71.908034  14117.289614
42    Europe  1982  72.767655  15433.001746
43    Europe  1987  73.583276  17031.164094
44    Europe  1992  74.370448  16767.981787
45    Europe  1997  75.435345  18784.215773
46    Europe  2002  76.644759  21409.175480
47    Europe  2007  77.586793  24756.615310
48   Oceania  1952  69.255000  10298.085650
49   Oceania  1957  70.295000  11598.522455
50   Oceania  1962  71.085000  12696.452430
51   Oceania  1967  71.310000  14463.918930
52   Oceania  1972  71.910000  16417.333380
53   Oceania  1977  72.855000  17283.957605
54   Oceania  1982  74.290000  18554.709840
55   Oceania  1987  75.320000  20448.040160
56   Oceania  1992  76.945000  20894.045885
57   Oceania  1997  78.190000  24024.175170
58   Oceania  2002  79.740000  26938.778040
59   Oceania  2007  80.719500  29810.188275

In [52]:
df.groupby('continent')['country'].nunique()

continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

In [54]:
df.sort_values(['lifeExp','year'],ascending=[False,True])

,country,continent,year,lifeExp,pop,gdpPercap,iso_alpha
803,Japan,Asia,2007,82.603,127467972,31656.068060,JPN
671,"Hong Kong, China",Asia,2007,82.208,6980412,39724.978670,HKG
802,Japan,Asia,2002,82.000,127065841,28604.591900,JPN
695,Iceland,Europe,2007,81.757,301931,36180.789190,ISL
1487,Switzerland,Europe,2007,81.701,7554661,37506.419070,CHE
...,...,...,...,...,...,...,...
36,Angola,Africa,1952,30.015,4232095,3520.610273,AGO
552,Gambia,Africa,1952,30.000,284320,485.230659,GMB
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG
1292,Rwanda,Africa,1992,23.599,7290203,737.068595,RWA
12,Albania,Europe,1952,NaN,1282697,1601.056136,ALB

In [55]:
pd.Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [59]:
pd.DataFrame([[10,20],[30,40]],columns=['A','B'])

    A   B
0  10  20
1  30  40

In [64]:
a = pd.DataFrame({'A':[10,30],'B':[10,30]})
b= pd.DataFrame({'A':[10,30],'C':[10,30]})

In [65]:
 a

    A   B
0  10  10
1  30  30

In [66]:
b

    A   C
0  10  10
1  30  30

In [69]:
pd.concat([a,b],axis=1)

    A   B   A   C
0  10  10  10  10
1  30  30  30  30

In [73]:
dis = pd.read_csv('data/ebola_large_sample.csv')
dis

,Date,Cases_Guinea,Cases_Liberia,Cases_Nigeria,Cases_Senegal,Cases_UnitedKingdom,Cases_Mali,Deaths
0,2014-03-01,860.0,804.0,70.0,157.0,39.0,129.0,2681.0
1,2014-03-02,3772.0,2731.0,51.0,45.0,15.0,34.0,1217.0
2,2014-03-03,3092.0,2773.0,32.0,116.0,12.0,80.0,1540.0
3,2014-03-04,466.0,1570.0,39.0,5.0,49.0,89.0,2076.0
4,2014-03-05,4426.0,2690.0,38.0,98.0,41.0,7.0,1445.0
...,...,...,...,...,...,...,...,...
95,2014-06-04,4875.0,1369.0,63.0,108.0,28.0,NaN,928.0
96,2014-06-05,3104.0,NaN,48.0,NaN,12.0,169.0,NaN
97,2014-06-06,4598.0,146.0,16.0,93.0,11.0,136.0,NaN
98,2014-06-07,NaN,3219.0,43.0,46.0,30.0,177.0,2779.0
99,2014-06-08,3645.0,NaN,91.0,98.0,45.0,26.0,2799.0

In [78]:
dis.Cases_Guinea.mean()

np.float64(2464.391304347826)

In [81]:
import numpy as np

In [82]:
np.nan == np.nan

False

In [84]:
np.nan is np.nan

True

In [87]:
pd.isnull(np.nan)

True

In [88]:
dis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 100 non-null    object
 1   Cases_Guinea         92 non-null     float64
 2   Cases_Liberia        91 non-null     float64
 3   Cases_Nigeria        97 non-null     float64
 4   Cases_Senegal        86 non-null     float64
 5   Cases_UnitedKingdom  91 non-null     float64
 6   Cases_Mali           89 non-null     float64
 7   Deaths               89 non-null     float64
dtypes: float64(7), object(1)
memory usage: 5.9+ KB

In [89]:
dis.describe()

,Cases_Guinea,Cases_Liberia,Cases_Nigeria,Cases_Senegal,Cases_UnitedKingdom,Cases_Mali,Deaths
count,92.000000,91.000000,97.000000,86.000000,91.000000,89.000000,89.000000
mean,2464.391304,2481.978022,46.711340,97.581395,24.890110,107.640449,1431.314607
std,1460.849993,1310.048964,29.336751,54.634069,14.240358,55.873690,844.688372
min,34.000000,146.000000,0.000000,4.000000,0.000000,6.000000,38.000000
25%,1158.500000,1426.500000,23.000000,53.000000,12.500000,68.000000,814.000000
50%,2557.000000,2675.000000,41.000000,98.000000,25.000000,112.000000,1353.000000
75%,3676.750000,3465.500000,70.000000,142.750000,36.000000,150.000000,2076.000000
max,4911.000000,4931.000000,99.000000,193.000000,49.000000,198.000000,2933.000000

In [91]:
dis.head()

,Date,Cases_Guinea,Cases_Liberia,Cases_Nigeria,Cases_Senegal,Cases_UnitedKingdom,Cases_Mali,Deaths
0,2014-03-01,860.0,804.0,70.0,157.0,39.0,129.0,2681.0
1,2014-03-02,3772.0,2731.0,51.0,45.0,15.0,34.0,1217.0
2,2014-03-03,3092.0,2773.0,32.0,116.0,12.0,80.0,1540.0
3,2014-03-04,466.0,1570.0,39.0,5.0,49.0,89.0,2076.0
4,2014-03-05,4426.0,2690.0,38.0,98.0,41.0,7.0,1445.0

In [92]:
disease['Cases_Guinea'].value_counts()

Cases_Guinea
860.0     1
161.0     1
1016.0    1
1275.0    1
3798.0    1
         ..
1267.0    1
1899.0    1
4658.0    1
3005.0    1
3645.0    1
Name: count, Length: 92, dtype: int64

In [93]:
disease['Cases_Guinea'].unique()

array([ 860., 3772., 3092.,  466., 4426., 3444., 3171., 2919.,  130.,
         nan, 2391., 2433., 1184., 4555., 3385., 4117., 4843., 2904.,
        474., 1082., 2558., 2047.,  975., 1806.,  189., 2734., 3005.,
       4658., 1899., 1267., 1528., 3202., 3556., 3890.,  646., 2888.,
       2435.,  600., 2363., 2061.,  241., 2041., 2824., 2612., 1363.,
       1478., 2556.,  775., 4014.,   34., 1955., 1585., 3943., 3073.,
       1021., 2613., 3843., 1500., 4798.,  161., 4297., 1981.,  995.,
       4911., 3342., 4551., 3798., 1275., 1016.,  337.,  878., 1076.,
       4887., 3993., 4859.,  379.,  492., 3884.,   64., 2568., 2027.,
       2695., 1495.,  391., 4514., 4474., 3561., 2278., 3099., 4875.,
       3104., 4598., 3645.])

In [95]:
disease['Cases_Guinea'].nunique(dropna=False)

93

In [97]:
dis

,Date,Cases_Guinea,Cases_Liberia,Cases_Nigeria,Cases_Senegal,Cases_UnitedKingdom,Cases_Mali,Deaths
0,2014-03-01,860.0,804.0,70.0,157.0,39.0,129.0,2681.0
1,2014-03-02,3772.0,2731.0,51.0,45.0,15.0,34.0,1217.0
2,2014-03-03,3092.0,2773.0,32.0,116.0,12.0,80.0,1540.0
3,2014-03-04,466.0,1570.0,39.0,5.0,49.0,89.0,2076.0
4,2014-03-05,4426.0,2690.0,38.0,98.0,41.0,7.0,1445.0
...,...,...,...,...,...,...,...,...
95,2014-06-04,4875.0,1369.0,63.0,108.0,28.0,NaN,928.0
96,2014-06-05,3104.0,NaN,48.0,NaN,12.0,169.0,NaN
97,2014-06-06,4598.0,146.0,16.0,93.0,11.0,136.0,NaN
98,2014-06-07,NaN,3219.0,43.0,46.0,30.0,177.0,2779.0
99,2014-06-08,3645.0,NaN,91.0,98.0,45.0,26.0,2799.0

In [102]:
m = dis['Cases_Guinea'].mean()

In [109]:
disease['Cases_Guinea'].replace(to_replace=np.nan, value= 999999999,inplace=True)

<ipython-input-109-23e4360cb8e8>:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  disease['Cases_Guinea'].replace(to_replace=np.nan, value= 999999999,inplace=True)

In [110]:
disease

,Date,Cases_Guinea,Cases_Liberia,Cases_Nigeria,Cases_Senegal,Cases_UnitedKingdom,Cases_Mali,Deaths
0,2014-03-01,860.0,804.0,70.0,157.0,39.0,129.0,2681.0
1,2014-03-02,3772.0,2731.0,51.0,45.0,15.0,34.0,1217.0
2,2014-03-03,3092.0,2773.0,32.0,116.0,12.0,80.0,1540.0
3,2014-03-04,466.0,1570.0,39.0,5.0,49.0,89.0,2076.0
4,2014-03-05,4426.0,2690.0,38.0,98.0,41.0,7.0,1445.0
...,...,...,...,...,...,...,...,...
95,2014-06-04,4875.0,1369.0,63.0,108.0,28.0,NaN,928.0
96,2014-06-05,3104.0,NaN,48.0,NaN,12.0,169.0,NaN
97,2014-06-06,4598.0,146.0,16.0,93.0,11.0,136.0,NaN
98,2014-06-07,999999999.0,3219.0,43.0,46.0,30.0,177.0,2779.0
99,2014-06-08,3645.0,NaN,91.0,98.0,45.0,26.0,2799.0